app/Controllers/Peminjaman.php

SELECT `peminjaman`.*, `buku`.`judul`, `users`.`nama`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
JOIN `users` ON `users`.`id_user` = `peminjaman`.`id_user`
ORDER BY `tanggal_pinjam` DESC
---
    public function index()
    {
        $data = [
            'title'      => 'Daftar Peminjaman Buku',
            // Mengambil data peminjaman dengan join ke tabel buku dan users
            'peminjaman' => $this->peminjamanModel
                            ->select('peminjaman.*, buku.judul, users.nama')
                            ->join('buku', 'buku.id_buku = peminjaman.id_buku')
                            ->join('users', 'users.id_user = peminjaman.id_user')
                            ->orderBy('tanggal_pinjam', 'DESC')
                            ->findAll()

SELECT *
FROM `buku`
WHERE `stok` > 0
---
public function tambah()
{
    $data = [
        'title' => 'Tambah Peminjaman Baru',
        // Mengambil buku yang stoknya masih ada
        'buku'  => $this->bukuModel->where('stok >', 0)->findAll(),

INSERT INTO `peminjaman` (`id_buku`, `id_user`, `tanggal_pinjam`, `status`) VALUES ('9', '3', '2026-04-11 17:50:15', 'dipinjam')
---
public function simpan($id_buku = null)
{
    // Ambil ID Buku dari parameter URL atau input form
    $id_buku = $id_buku ?? $this->request->getPost('id_buku');
    $id_user = $this->request->getPost('id_user') ?? session()->get('id_user');

    if (!$id_buku || !$id_user) {
        return redirect()->back()->with('error', 'Data tidak lengkap!');
    }

    $buku = $this->bukuModel->find($id_buku);

    if ($buku && $buku['stok'] > 0) {
        // Simpan data ke tabel peminjaman
        $this->peminjamanModel->save([
            'id_buku'        => $id_buku,
            'id_user'        => $id_user,
            'tanggal_pinjam' => date('Y-m-d H:i:s'),
            'status'         => 'dipinjam'
        ]);