app/Controllers/Pengembalian.php

SELECT `peminjaman`.*, `buku`.`judul`, `users`.`nama`
FROM `peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `peminjaman`.`id_buku`
JOIN `users` ON `users`.`id_user` = `peminjaman`.`id_user`
WHERE `peminjaman`.`status` = 'dikembalikan'
---
  public function index()
{
    $db      = \Config\Database::connect();
    $builder = $db->table('peminjaman');

    // Melakukan Join tabel
    $builder->select('peminjaman.*, buku.judul, users.nama');
    $builder->join('buku', 'buku.id_buku = peminjaman.id_buku');
    $builder->join('users', 'users.id_user = peminjaman.id_user');

    // MENGATASI AMBIGU: Sebutkan 'peminjaman.status'
    $builder->where('peminjaman.status', 'dikembalikan');

    $data = [
        'title'      => 'Data Pengembalian',
        'pengembalian' => $builder->get()->getResultArray(),